/* automatically generated by rust-bindgen 0.72.1 */

#[doc = " Error codes returned by PortAudio functions.\nNote that with the exception of paNoError, all PaErrorCodes are negative."]
pub type PaError = ::std::os::raw::c_int;
#[doc = "A single PaStream can provide multiple channels of real-time\nstreaming audio input and output to a client application. A stream\nprovides access to audio hardware represented by one or more\nPaDevices. Depending on the underlying Host API, it may be possible\nto open multiple streams using the same device, however this behavior\nis implementation defined. Portable applications should assume that\na PaDevice may be simultaneously used by at most one PaStream.\n\nPointers to PaStream objects are passed between PortAudio functions that\noperate on streams.\n\n@see Pa_OpenStream, Pa_OpenDefaultStream, Pa_OpenDefaultStream, Pa_CloseStream,\nPa_StartStream, Pa_StopStream, Pa_AbortStream, Pa_IsStreamActive,\nPa_GetStreamTime, Pa_GetStreamCpuLoad"]
pub type PaStream = ::std::os::raw::c_void;
#[repr(C)]
pub struct PaAlsaStreamInfo {
    pub size: ::std::os::raw::c_ulong,
    pub hostApiType: PaHostApiTypeId,
    pub version: ::std::os::raw::c_ulong,
    pub deviceString: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaAlsaStreamInfo"][::std::mem::size_of::<PaAlsaStreamInfo>() - 32usize];
    ["Alignment of PaAlsaStreamInfo"][::std::mem::align_of::<PaAlsaStreamInfo>() - 8usize];
    ["Offset of field: PaAlsaStreamInfo::size"]
        [::std::mem::offset_of!(PaAlsaStreamInfo, size) - 0usize];
    ["Offset of field: PaAlsaStreamInfo::hostApiType"]
        [::std::mem::offset_of!(PaAlsaStreamInfo, hostApiType) - 8usize];
    ["Offset of field: PaAlsaStreamInfo::version"]
        [::std::mem::offset_of!(PaAlsaStreamInfo, version) - 16usize];
    ["Offset of field: PaAlsaStreamInfo::deviceString"]
        [::std::mem::offset_of!(PaAlsaStreamInfo, deviceString) - 24usize];
};
unsafe extern "C" {
    #[doc = " Initialize host API specific structure, call this before setting relevant attributes."]
    pub fn PaAlsa_InitializeStreamInfo(info: *mut PaAlsaStreamInfo);
}
unsafe extern "C" {
    #[doc = " Instruct whether to enable real-time priority when starting the audio thread.\n\n If this is turned on by the stream is started, the audio callback thread will be created\n with the FIFO scheduling policy, which is suitable for realtime operation."]
    pub fn PaAlsa_EnableRealtimeScheduling(s: *mut PaStream, enable: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " Get the ALSA-lib card index of this stream's input device."]
    pub fn PaAlsa_GetStreamInputCard(s: *mut PaStream, card: *mut ::std::os::raw::c_int)
    -> PaError;
}
unsafe extern "C" {
    #[doc = " Get the ALSA-lib card index of this stream's output device."]
    pub fn PaAlsa_GetStreamOutputCard(
        s: *mut PaStream,
        card: *mut ::std::os::raw::c_int,
    ) -> PaError;
}
unsafe extern "C" {
    #[doc = " Set the number of periods (buffer fragments) to configure devices with.\n\n By default the number of periods is 4, this is the lowest number of periods that works well on\n the author's soundcard.\n @param numPeriods The number of periods."]
    pub fn PaAlsa_SetNumPeriods(numPeriods: ::std::os::raw::c_int) -> PaError;
}
unsafe extern "C" {
    #[doc = " Set the maximum number of times to retry opening busy device (sleeping for a\n short interval inbetween)."]
    pub fn PaAlsa_SetRetriesBusy(retries: ::std::os::raw::c_int) -> PaError;
}
unsafe extern "C" {
    #[doc = " Set the path and name of ALSA library file if PortAudio is configured to load it dynamically (see\n  PA_ALSA_DYNAMIC). This setting will overwrite the default name set by PA_ALSA_PATHNAME define.\n @param pathName Full path with filename. Only filename can be used, but dlopen() will lookup default\n                 searchable directories (/usr/lib;/usr/local/lib) then."]
    pub fn PaAlsa_SetLibraryPathName(pathName: *const ::std::os::raw::c_char);
}
