/* automatically generated by rust-bindgen 0.72.1 */

pub const paFormatIsSupported: u32 = 0;
pub const paFramesPerBufferUnspecified: u32 = 0;
unsafe extern "C" {
    #[doc = " Retrieve the release number of the currently running PortAudio build.\nFor example, for version \"19.5.1\" this will return 0x00130501.\n\n@see paMakeVersionNumber"]
    pub fn Pa_GetVersion() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Retrieve a textual description of the current PortAudio build,\ne.g. \"PortAudio V19.5.0-devel, revision 1952M\".\nThe format of the text may change in the future. Do not try to parse the\nreturned string.\n\n@deprecated As of 19.5.0, use Pa_GetVersionInfo()->versionText instead."]
    pub fn Pa_GetVersionText() -> *const ::std::os::raw::c_char;
}
#[doc = "A structure containing PortAudio API version information.\n@see Pa_GetVersionInfo, paMakeVersionNumber\n@version Available as of 19.5.0."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PaVersionInfo {
    pub versionMajor: ::std::os::raw::c_int,
    pub versionMinor: ::std::os::raw::c_int,
    pub versionSubMinor: ::std::os::raw::c_int,
    #[doc = "This is currently the Git revision hash but may change in the future.\nThe versionControlRevision is updated by running a script before compiling the library.\nIf the update does not occur, this value may refer to an earlier revision."]
    pub versionControlRevision: *const ::std::os::raw::c_char,
    #[doc = " Version as a string, for example \"PortAudio V19.5.0-devel, revision 1952M\""]
    pub versionText: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaVersionInfo"][::std::mem::size_of::<PaVersionInfo>() - 32usize];
    ["Alignment of PaVersionInfo"][::std::mem::align_of::<PaVersionInfo>() - 8usize];
    ["Offset of field: PaVersionInfo::versionMajor"]
        [::std::mem::offset_of!(PaVersionInfo, versionMajor) - 0usize];
    ["Offset of field: PaVersionInfo::versionMinor"]
        [::std::mem::offset_of!(PaVersionInfo, versionMinor) - 4usize];
    ["Offset of field: PaVersionInfo::versionSubMinor"]
        [::std::mem::offset_of!(PaVersionInfo, versionSubMinor) - 8usize];
    ["Offset of field: PaVersionInfo::versionControlRevision"]
        [::std::mem::offset_of!(PaVersionInfo, versionControlRevision) - 16usize];
    ["Offset of field: PaVersionInfo::versionText"]
        [::std::mem::offset_of!(PaVersionInfo, versionText) - 24usize];
};
unsafe extern "C" {
    #[doc = " Retrieve version information for the currently running PortAudio build.\n@return A pointer to an immutable PaVersionInfo structure.\n\n@note This function can be called at any time. It does not require PortAudio\nto be initialized. The structure pointed to is statically allocated. Do not\nattempt to free it or modify it.\n\n@see PaVersionInfo, paMakeVersionNumber\n@version Available as of 19.5.0."]
    pub fn Pa_GetVersionInfo() -> *const PaVersionInfo;
}
#[doc = " Error codes returned by PortAudio functions.\nNote that with the exception of paNoError, all PaErrorCodes are negative."]
pub type PaError = ::std::os::raw::c_int;
unsafe extern "C" {
    #[doc = " Translate the supplied PortAudio error code into a human readable\nmessage."]
    pub fn Pa_GetErrorText(errorCode: PaError) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Library initialization function - call this before using PortAudio.\nThis function initializes internal data structures and prepares underlying\nhost APIs for use.  With the exception of Pa_GetVersion(), Pa_GetVersionText(),\nand Pa_GetErrorText(), this function MUST be called before using any other\nPortAudio API functions.\n\nIf Pa_Initialize() is called multiple times, each successful\ncall must be matched with a corresponding call to Pa_Terminate().\nPairs of calls to Pa_Initialize()/Pa_Terminate() may overlap, and are not\nrequired to be fully nested.\n\nNote that if Pa_Initialize() returns an error code, Pa_Terminate() should\nNOT be called.\n\n@return paNoError if successful, otherwise an error code indicating the cause\nof failure.\n\n@see Pa_Terminate"]
    pub fn Pa_Initialize() -> PaError;
}
unsafe extern "C" {
    #[doc = " Library termination function - call this when finished using PortAudio.\nThis function deallocates all resources allocated by PortAudio since it was\ninitialized by a call to Pa_Initialize(). In cases where Pa_Initialise() has\nbeen called multiple times, each call must be matched with a corresponding call\nto Pa_Terminate(). The final matching call to Pa_Terminate() will automatically\nclose any PortAudio streams that are still open.\n\nPa_Terminate() MUST be called before exiting a program which uses PortAudio.\nFailure to do so may result in serious resource leaks, such as audio devices\nnot being available until the next reboot.\n\n@return paNoError if successful, otherwise an error code indicating the cause\nof failure.\n\n@see Pa_Initialize"]
    pub fn Pa_Terminate() -> PaError;
}
#[doc = " The type used to refer to audio devices. Values of this type usually\nrange from 0 to (Pa_GetDeviceCount()-1), and may also take on the PaNoDevice\nand paUseHostApiSpecificDeviceSpecification values.\n\n@see Pa_GetDeviceCount, paNoDevice, paUseHostApiSpecificDeviceSpecification"]
pub type PaDeviceIndex = ::std::os::raw::c_int;
#[doc = " The type used to enumerate to host APIs at runtime. Values of this type\nrange from 0 to (Pa_GetHostApiCount()-1).\n\n@see Pa_GetHostApiCount"]
pub type PaHostApiIndex = ::std::os::raw::c_int;
unsafe extern "C" {
    #[doc = " Retrieve the number of available host APIs. Even if a host API is\navailable it may have no devices available.\n\n@return A non-negative value indicating the number of available host APIs\nor, a PaErrorCode (which are always negative) if PortAudio is not initialized\nor an error is encountered.\n\n@see PaHostApiIndex"]
    pub fn Pa_GetHostApiCount() -> PaHostApiIndex;
}
unsafe extern "C" {
    #[doc = " Retrieve the index of the default host API. The default host API will be\nthe lowest common denominator host API on the current platform and is\nunlikely to provide the best performance.\n\n@return A non-negative value ranging from 0 to (Pa_GetHostApiCount()-1)\nindicating the default host API index or, a PaErrorCode (which are always\nnegative) if PortAudio is not initialized or an error is encountered."]
    pub fn Pa_GetDefaultHostApi() -> PaHostApiIndex;
}
#[doc = " A structure containing information about a particular host API."]
#[repr(C)]
pub struct PaHostApiInfo {
    #[doc = " this is struct version 1"]
    pub structVersion: ::std::os::raw::c_int,
    #[doc = " The well known unique identifier of this host API @see PaHostApiTypeId"]
    pub type_: PaHostApiTypeId,
    #[doc = " A textual description of the host API for display on user interfaces."]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "  The number of devices belonging to this host API. This field may be\nused in conjunction with Pa_HostApiDeviceIndexToDeviceIndex() to enumerate\nall devices for this host API.\n@see Pa_HostApiDeviceIndexToDeviceIndex"]
    pub deviceCount: ::std::os::raw::c_int,
    #[doc = " The default input device for this host API. The value will be a\ndevice index ranging from 0 to (Pa_GetDeviceCount()-1), or paNoDevice\nif no default input device is available."]
    pub defaultInputDevice: PaDeviceIndex,
    #[doc = " The default output device for this host API. The value will be a\ndevice index ranging from 0 to (Pa_GetDeviceCount()-1), or paNoDevice\nif no default output device is available."]
    pub defaultOutputDevice: PaDeviceIndex,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaHostApiInfo"][::std::mem::size_of::<PaHostApiInfo>() - 32usize];
    ["Alignment of PaHostApiInfo"][::std::mem::align_of::<PaHostApiInfo>() - 8usize];
    ["Offset of field: PaHostApiInfo::structVersion"]
        [::std::mem::offset_of!(PaHostApiInfo, structVersion) - 0usize];
    ["Offset of field: PaHostApiInfo::type_"]
        [::std::mem::offset_of!(PaHostApiInfo, type_) - 4usize];
    ["Offset of field: PaHostApiInfo::name"][::std::mem::offset_of!(PaHostApiInfo, name) - 8usize];
    ["Offset of field: PaHostApiInfo::deviceCount"]
        [::std::mem::offset_of!(PaHostApiInfo, deviceCount) - 16usize];
    ["Offset of field: PaHostApiInfo::defaultInputDevice"]
        [::std::mem::offset_of!(PaHostApiInfo, defaultInputDevice) - 20usize];
    ["Offset of field: PaHostApiInfo::defaultOutputDevice"]
        [::std::mem::offset_of!(PaHostApiInfo, defaultOutputDevice) - 24usize];
};
unsafe extern "C" {
    #[doc = " Retrieve a pointer to a structure containing information about a specific\nhost Api.\n\n@param hostApi A valid host API index ranging from 0 to (Pa_GetHostApiCount()-1)\n\n@return A pointer to an immutable PaHostApiInfo structure describing\na specific host API. If the hostApi parameter is out of range or an error\nis encountered, the function returns NULL.\n\nThe returned structure is owned by the PortAudio implementation and must not\nbe manipulated or freed. The pointer is only guaranteed to be valid between\ncalls to Pa_Initialize() and Pa_Terminate()."]
    pub fn Pa_GetHostApiInfo(hostApi: PaHostApiIndex) -> *const PaHostApiInfo;
}
unsafe extern "C" {
    #[doc = " Convert a static host API unique identifier, into a runtime\nhost API index.\n\n@param type A unique host API identifier belonging to the PaHostApiTypeId\nenumeration.\n\n@return A valid PaHostApiIndex ranging from 0 to (Pa_GetHostApiCount()-1) or,\na PaErrorCode (which are always negative) if PortAudio is not initialized\nor an error is encountered.\n\nThe paHostApiNotFound error code indicates that the host API specified by the\ntype parameter is not available.\n\n@see PaHostApiTypeId"]
    pub fn Pa_HostApiTypeIdToHostApiIndex(type_: PaHostApiTypeId) -> PaHostApiIndex;
}
unsafe extern "C" {
    #[doc = " Convert a host-API-specific device index to standard PortAudio device index.\nThis function may be used in conjunction with the deviceCount field of\nPaHostApiInfo to enumerate all devices for the specified host API.\n\n@param hostApi A valid host API index ranging from 0 to (Pa_GetHostApiCount()-1)\n\n@param hostApiDeviceIndex A valid per-host device index in the range\n0 to (Pa_GetHostApiInfo(hostApi)->deviceCount-1)\n\n@return A non-negative PaDeviceIndex ranging from 0 to (Pa_GetDeviceCount()-1)\nor, a PaErrorCode (which are always negative) if PortAudio is not initialized\nor an error is encountered.\n\nA paInvalidHostApi error code indicates that the host API index specified by\nthe hostApi parameter is out of range.\n\nA paInvalidDevice error code indicates that the hostApiDeviceIndex parameter\nis out of range.\n\n@see PaHostApiInfo"]
    pub fn Pa_HostApiDeviceIndexToDeviceIndex(
        hostApi: PaHostApiIndex,
        hostApiDeviceIndex: ::std::os::raw::c_int,
    ) -> PaDeviceIndex;
}
#[doc = " Structure used to return information about a host error condition."]
#[repr(C)]
pub struct PaHostErrorInfo {
    #[doc = "< the host API which returned the error code"]
    pub hostApiType: PaHostApiTypeId,
    #[doc = "< the error code returned"]
    pub errorCode: ::std::os::raw::c_long,
    #[doc = "< a textual description of the error if available, otherwise a zero-length string"]
    pub errorText: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaHostErrorInfo"][::std::mem::size_of::<PaHostErrorInfo>() - 24usize];
    ["Alignment of PaHostErrorInfo"][::std::mem::align_of::<PaHostErrorInfo>() - 8usize];
    ["Offset of field: PaHostErrorInfo::hostApiType"]
        [::std::mem::offset_of!(PaHostErrorInfo, hostApiType) - 0usize];
    ["Offset of field: PaHostErrorInfo::errorCode"]
        [::std::mem::offset_of!(PaHostErrorInfo, errorCode) - 8usize];
    ["Offset of field: PaHostErrorInfo::errorText"]
        [::std::mem::offset_of!(PaHostErrorInfo, errorText) - 16usize];
};
unsafe extern "C" {
    #[doc = " Return information about the last host error encountered. The error\ninformation returned by Pa_GetLastHostErrorInfo() will never be modified\nasynchronously by errors occurring in other PortAudio owned threads\n(such as the thread that manages the stream callback.)\n\nThis function is provided as a last resort, primarily to enhance debugging\nby providing clients with access to all available error information.\n\n@return A pointer to an immutable structure constraining information about\nthe host error. The values in this structure will only be valid if a\nPortAudio function has previously returned the paUnanticipatedHostError\nerror code."]
    pub fn Pa_GetLastHostErrorInfo() -> *const PaHostErrorInfo;
}
unsafe extern "C" {
    #[doc = " Retrieve the number of available devices. The number of available devices\nmay be zero.\n\n@return A non-negative value indicating the number of available devices or,\na PaErrorCode (which are always negative) if PortAudio is not initialized\nor an error is encountered."]
    pub fn Pa_GetDeviceCount() -> PaDeviceIndex;
}
unsafe extern "C" {
    #[doc = " Retrieve the index of the default input device. The result can be\nused in the inputDevice parameter to Pa_OpenStream().\n\n@return The default input device index for the default host API, or paNoDevice\nif no default input device is available or an error was encountered."]
    pub fn Pa_GetDefaultInputDevice() -> PaDeviceIndex;
}
unsafe extern "C" {
    #[doc = " Retrieve the index of the default output device. The result can be\nused in the outputDevice parameter to Pa_OpenStream().\n\n@return The default output device index for the default host API, or paNoDevice\nif no default output device is available or an error was encountered.\n\n@note\nOn the PC, the user can specify a default device by\nsetting an environment variable. For example, to use device #1.\n<pre>\nset PA_RECOMMENDED_OUTPUT_DEVICE=1\n</pre>\nThe user should first determine the available device ids by using\nthe supplied application \"pa_devs\"."]
    pub fn Pa_GetDefaultOutputDevice() -> PaDeviceIndex;
}
#[doc = " The type used to represent monotonic time in seconds. PaTime is\nused for the fields of the PaStreamCallbackTimeInfo argument to the\nPaStreamCallback and as the result of Pa_GetStreamTime().\n\nPaTime values have unspecified origin.\n\n@see PaStreamCallback, PaStreamCallbackTimeInfo, Pa_GetStreamTime"]
pub type PaTime = f64;
#[doc = " A type used to specify one or more sample formats. Each value indicates\na possible format for sound data passed to and from the stream callback,\nPa_ReadStream and Pa_WriteStream.\n\nThe standard formats paFloat32, paInt16, paInt32, paInt24, paInt8\nand aUInt8 are usually implemented by all implementations.\n\nThe floating point representation (paFloat32) uses +1.0 and -1.0 as the\nmaximum and minimum respectively.\n\npaUInt8 is an unsigned 8 bit format where 128 is considered \"ground\"\n\nThe paNonInterleaved flag indicates that audio data is passed as an array\nof pointers to separate buffers, one buffer for each channel. Usually,\nwhen this flag is not used, audio data is passed as a single buffer with\nall channels interleaved.\n\n@see Pa_OpenStream, Pa_OpenDefaultStream, PaDeviceInfo\n@see paFloat32, paInt16, paInt32, paInt24, paInt8\n@see paUInt8, paCustomFormat, paNonInterleaved"]
pub type PaSampleFormat = ::std::os::raw::c_ulong;
#[doc = " A structure providing information and capabilities of PortAudio devices.\nDevices may support input, output or both input and output."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PaDeviceInfo {
    pub structVersion: ::std::os::raw::c_int,
    pub name: *const ::std::os::raw::c_char,
    #[doc = "< note this is a host API index, not a type id"]
    pub hostApi: PaHostApiIndex,
    pub maxInputChannels: ::std::os::raw::c_int,
    pub maxOutputChannels: ::std::os::raw::c_int,
    #[doc = " Default latency values for interactive performance."]
    pub defaultLowInputLatency: PaTime,
    pub defaultLowOutputLatency: PaTime,
    #[doc = " Default latency values for robust non-interactive applications (eg. playing sound files)."]
    pub defaultHighInputLatency: PaTime,
    pub defaultHighOutputLatency: PaTime,
    pub defaultSampleRate: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaDeviceInfo"][::std::mem::size_of::<PaDeviceInfo>() - 72usize];
    ["Alignment of PaDeviceInfo"][::std::mem::align_of::<PaDeviceInfo>() - 8usize];
    ["Offset of field: PaDeviceInfo::structVersion"]
        [::std::mem::offset_of!(PaDeviceInfo, structVersion) - 0usize];
    ["Offset of field: PaDeviceInfo::name"][::std::mem::offset_of!(PaDeviceInfo, name) - 8usize];
    ["Offset of field: PaDeviceInfo::hostApi"]
        [::std::mem::offset_of!(PaDeviceInfo, hostApi) - 16usize];
    ["Offset of field: PaDeviceInfo::maxInputChannels"]
        [::std::mem::offset_of!(PaDeviceInfo, maxInputChannels) - 20usize];
    ["Offset of field: PaDeviceInfo::maxOutputChannels"]
        [::std::mem::offset_of!(PaDeviceInfo, maxOutputChannels) - 24usize];
    ["Offset of field: PaDeviceInfo::defaultLowInputLatency"]
        [::std::mem::offset_of!(PaDeviceInfo, defaultLowInputLatency) - 32usize];
    ["Offset of field: PaDeviceInfo::defaultLowOutputLatency"]
        [::std::mem::offset_of!(PaDeviceInfo, defaultLowOutputLatency) - 40usize];
    ["Offset of field: PaDeviceInfo::defaultHighInputLatency"]
        [::std::mem::offset_of!(PaDeviceInfo, defaultHighInputLatency) - 48usize];
    ["Offset of field: PaDeviceInfo::defaultHighOutputLatency"]
        [::std::mem::offset_of!(PaDeviceInfo, defaultHighOutputLatency) - 56usize];
    ["Offset of field: PaDeviceInfo::defaultSampleRate"]
        [::std::mem::offset_of!(PaDeviceInfo, defaultSampleRate) - 64usize];
};
unsafe extern "C" {
    #[doc = " Retrieve a pointer to a PaDeviceInfo structure containing information\nabout the specified device.\n@return A pointer to an immutable PaDeviceInfo structure. If the device\nparameter is out of range the function returns NULL.\n\n@param device A valid device index in the range 0 to (Pa_GetDeviceCount()-1)\n\n@note PortAudio manages the memory referenced by the returned pointer,\nthe client must not manipulate or free the memory. The pointer is only\nguaranteed to be valid between calls to Pa_Initialize() and Pa_Terminate().\n\n@see PaDeviceInfo, PaDeviceIndex"]
    pub fn Pa_GetDeviceInfo(device: PaDeviceIndex) -> *const PaDeviceInfo;
}
#[doc = " Parameters for one direction (input or output) of a stream."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PaStreamParameters {
    #[doc = " A valid device index in the range 0 to (Pa_GetDeviceCount()-1)\nspecifying the device to be used or the special constant\npaUseHostApiSpecificDeviceSpecification which indicates that the actual\ndevice(s) to use are specified in hostApiSpecificStreamInfo.\nThis field must not be set to paNoDevice."]
    pub device: PaDeviceIndex,
    #[doc = " The number of channels of sound to be delivered to the\nstream callback or accessed by Pa_ReadStream() or Pa_WriteStream().\nIt can range from 1 to the value of maxInputChannels in the\nPaDeviceInfo record for the device specified by the device parameter."]
    pub channelCount: ::std::os::raw::c_int,
    #[doc = " The sample format of the buffer provided to the stream callback,\na_ReadStream() or Pa_WriteStream(). It may be any of the formats described\nby the PaSampleFormat enumeration."]
    pub sampleFormat: PaSampleFormat,
    #[doc = " The desired latency in seconds. Where practical, implementations should\nconfigure their latency based on these parameters, otherwise they may\nchoose the closest viable latency instead. Unless the suggested latency\nis greater than the absolute upper limit for the device implementations\nshould round the suggestedLatency up to the next practical value - ie to\nprovide an equal or higher latency than suggestedLatency wherever possible.\nActual latency values for an open stream may be retrieved using the\ninputLatency and outputLatency fields of the PaStreamInfo structure\nreturned by Pa_GetStreamInfo().\n@see default*Latency in PaDeviceInfo, *Latency in PaStreamInfo"]
    pub suggestedLatency: PaTime,
    #[doc = " An optional pointer to a host api specific data structure\ncontaining additional information for device setup and/or stream processing.\nhostApiSpecificStreamInfo is never required for correct operation,\nif not used it should be set to NULL."]
    pub hostApiSpecificStreamInfo: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaStreamParameters"][::std::mem::size_of::<PaStreamParameters>() - 32usize];
    ["Alignment of PaStreamParameters"][::std::mem::align_of::<PaStreamParameters>() - 8usize];
    ["Offset of field: PaStreamParameters::device"]
        [::std::mem::offset_of!(PaStreamParameters, device) - 0usize];
    ["Offset of field: PaStreamParameters::channelCount"]
        [::std::mem::offset_of!(PaStreamParameters, channelCount) - 4usize];
    ["Offset of field: PaStreamParameters::sampleFormat"]
        [::std::mem::offset_of!(PaStreamParameters, sampleFormat) - 8usize];
    ["Offset of field: PaStreamParameters::suggestedLatency"]
        [::std::mem::offset_of!(PaStreamParameters, suggestedLatency) - 16usize];
    ["Offset of field: PaStreamParameters::hostApiSpecificStreamInfo"]
        [::std::mem::offset_of!(PaStreamParameters, hostApiSpecificStreamInfo) - 24usize];
};
unsafe extern "C" {
    #[doc = " Determine whether it would be possible to open a stream with the specified\nparameters.\n\n@param inputParameters A structure that describes the input parameters used to\nopen a stream. The suggestedLatency field is ignored. See PaStreamParameters\nfor a description of these parameters. inputParameters must be NULL for\noutput-only streams.\n\n@param outputParameters A structure that describes the output parameters used\nto open a stream. The suggestedLatency field is ignored. See PaStreamParameters\nfor a description of these parameters. outputParameters must be NULL for\ninput-only streams.\n\n@param sampleRate The required sampleRate. For full-duplex streams it is the\nsample rate for both input and output\n\n@return Returns 0 if the format is supported, and an error code indicating why\nthe format is not supported otherwise. The constant paFormatIsSupported is\nprovided to compare with the return value for success.\n\n@see paFormatIsSupported, PaStreamParameters"]
    pub fn Pa_IsFormatSupported(
        inputParameters: *const PaStreamParameters,
        outputParameters: *const PaStreamParameters,
        sampleRate: f64,
    ) -> PaError;
}
#[doc = "A single PaStream can provide multiple channels of real-time\nstreaming audio input and output to a client application. A stream\nprovides access to audio hardware represented by one or more\nPaDevices. Depending on the underlying Host API, it may be possible\nto open multiple streams using the same device, however this behavior\nis implementation defined. Portable applications should assume that\na PaDevice may be simultaneously used by at most one PaStream.\n\nPointers to PaStream objects are passed between PortAudio functions that\noperate on streams.\n\n@see Pa_OpenStream, Pa_OpenDefaultStream, Pa_OpenDefaultStream, Pa_CloseStream,\nPa_StartStream, Pa_StopStream, Pa_AbortStream, Pa_IsStreamActive,\nPa_GetStreamTime, Pa_GetStreamCpuLoad"]
pub type PaStream = ::std::os::raw::c_void;
#[doc = " Flags used to control the behavior of a stream. They are passed as\nparameters to Pa_OpenStream or Pa_OpenDefaultStream. Multiple flags may be\nORed together.\n\n@see Pa_OpenStream, Pa_OpenDefaultStream\n@see paNoFlag, paClipOff, paDitherOff, paNeverDropInput,\npaPrimeOutputBuffersUsingStreamCallback, paPlatformSpecificFlags"]
pub type PaStreamFlags = ::std::os::raw::c_ulong;
#[doc = "Timing information for the buffers passed to the stream callback.\n\nTime values are expressed in seconds and are synchronised with the time base used by Pa_GetStreamTime() for the associated stream.\n\n@see PaStreamCallback, Pa_GetStreamTime"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PaStreamCallbackTimeInfo {
    #[doc = "< The time when the first sample of the input buffer was captured at the ADC input"]
    pub inputBufferAdcTime: PaTime,
    #[doc = "< The time when the stream callback was invoked"]
    pub currentTime: PaTime,
    #[doc = "< The time when the first sample of the output buffer will output the DAC"]
    pub outputBufferDacTime: PaTime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaStreamCallbackTimeInfo"]
        [::std::mem::size_of::<PaStreamCallbackTimeInfo>() - 24usize];
    ["Alignment of PaStreamCallbackTimeInfo"]
        [::std::mem::align_of::<PaStreamCallbackTimeInfo>() - 8usize];
    ["Offset of field: PaStreamCallbackTimeInfo::inputBufferAdcTime"]
        [::std::mem::offset_of!(PaStreamCallbackTimeInfo, inputBufferAdcTime) - 0usize];
    ["Offset of field: PaStreamCallbackTimeInfo::currentTime"]
        [::std::mem::offset_of!(PaStreamCallbackTimeInfo, currentTime) - 8usize];
    ["Offset of field: PaStreamCallbackTimeInfo::outputBufferDacTime"]
        [::std::mem::offset_of!(PaStreamCallbackTimeInfo, outputBufferDacTime) - 16usize];
};
#[doc = "Flag bit constants for the statusFlags to PaStreamCallback.\n\n@see paInputUnderflow, paInputOverflow, paOutputUnderflow, paOutputOverflow,\npaPrimingOutput"]
pub type PaStreamCallbackFlags = ::std::os::raw::c_ulong;
#[doc = "Functions of type PaStreamCallback are implemented by PortAudio clients.\nThey consume, process or generate audio in response to requests from an\nactive PortAudio stream.\n\nWhen a stream is running, PortAudio calls the stream callback periodically.\nThe callback function is responsible for processing buffers of audio samples\npassed via the input and output parameters.\n\nThe PortAudio stream callback runs at very high or real-time priority.\nIt is required to consistently meet its time deadlines. Do not allocate\nmemory, access the file system, call library functions or call other functions\nfrom the stream callback that may block or take an unpredictable amount of\ntime to complete.\n\nIn order for a stream to maintain glitch-free operation the callback\nmust consume and return audio data faster than it is recorded and/or\nplayed. PortAudio anticipates that each callback invocation may execute for\na duration approaching the duration of frameCount audio frames at the stream\nsample rate. It is reasonable to expect to be able to utilise 70% or more of\nthe available CPU time in the PortAudio callback. However, due to buffer size\nadaption and other factors, not all host APIs are able to guarantee audio\nstability under heavy CPU load with arbitrary fixed callback buffer sizes.\nWhen high callback CPU utilisation is required the most robust behavior\ncan be achieved by using paFramesPerBufferUnspecified as the\nPa_OpenStream() framesPerBuffer parameter.\n\n@param input and @param output are either arrays of interleaved samples or;\nif non-interleaved samples were requested using the paNonInterleaved sample\nformat flag, an array of buffer pointers, one non-interleaved buffer for\neach channel.\n\nThe format, packing and number of channels used by the buffers are\ndetermined by parameters to Pa_OpenStream().\n\n@param frameCount The number of sample frames to be processed by\nthe stream callback.\n\n@param timeInfo Timestamps indicating the ADC capture time of the first sample\nin the input buffer, the DAC output time of the first sample in the output buffer\nand the time the callback was invoked.\nSee PaStreamCallbackTimeInfo and Pa_GetStreamTime()\n\n@param statusFlags Flags indicating whether input and/or output buffers\nhave been inserted or will be dropped to overcome underflow or overflow\nconditions.\n\n@param userData The value of a user supplied pointer passed to\nPa_OpenStream() intended for storing synthesis data etc.\n\n@return\nThe stream callback should return one of the values in the\n::PaStreamCallbackResult enumeration. To ensure that the callback continues\nto be called, it should return paContinue (0). Either paComplete or paAbort\ncan be returned to finish stream processing, after either of these values is\nreturned the callback will not be called again. If paAbort is returned the\nstream will finish as soon as possible. If paComplete is returned, the stream\nwill continue until all buffers generated by the callback have been played.\nThis may be useful in applications such as soundfile players where a specific\nduration of output is required. However, it is not necessary to utilize this\nmechanism as Pa_StopStream(), Pa_AbortStream() or Pa_CloseStream() can also\nbe used to stop the stream. The callback must always fill the entire output\nbuffer irrespective of its return value.\n\n@see Pa_OpenStream, Pa_OpenDefaultStream\n\n@note With the exception of Pa_GetStreamCpuLoad() it is not permissible to call\nPortAudio API functions from within the stream callback."]
pub type PaStreamCallback = ::std::option::Option<
    unsafe extern "C" fn(
        input: *const ::std::os::raw::c_void,
        output: *mut ::std::os::raw::c_void,
        frameCount: ::std::os::raw::c_ulong,
        timeInfo: *const PaStreamCallbackTimeInfo,
        statusFlags: PaStreamCallbackFlags,
        userData: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    #[doc = " Opens a stream for either input, output or both.\n\n@param stream The address of a PaStream pointer which will receive\na pointer to the newly opened stream.\n\n@param inputParameters A structure that describes the input parameters used by\nthe opened stream. See PaStreamParameters for a description of these parameters.\ninputParameters must be NULL for output-only streams.\n\n@param outputParameters A structure that describes the output parameters used by\nthe opened stream. See PaStreamParameters for a description of these parameters.\noutputParameters must be NULL for input-only streams.\n\n@param sampleRate The desired sampleRate. For full-duplex streams it is the\nsample rate for both input and output. Note that the actual sampleRate\nmay differ very slightly from the desired rate because of hardware limitations.\nThe exact rate can be queried using Pa_GetStreamInfo(). If nothing close\nto the desired sampleRate is available then the open will fail and return an error.\n\n@param framesPerBuffer The number of frames passed to the stream callback\nfunction, or the preferred block granularity for a blocking read/write stream.\nThe special value paFramesPerBufferUnspecified (0) may be used to request that\nthe stream callback will receive an optimal (and possibly varying) number of\nframes based on host requirements and the requested latency settings.\nNote: With some host APIs, the use of non-zero framesPerBuffer for a callback\nstream may introduce an additional layer of buffering which could introduce\nadditional latency. PortAudio guarantees that the additional latency\nwill be kept to the theoretical minimum however, it is strongly recommended\nthat a non-zero framesPerBuffer value only be used when your algorithm\nrequires a fixed number of frames per stream callback.\n\n@param streamFlags Flags which modify the behavior of the streaming process.\nThis parameter may contain a combination of flags ORed together. Some flags may\nonly be relevant to certain buffer formats.\n\n@param streamCallback A pointer to a client supplied function that is responsible\nfor processing and filling input and output buffers. If this parameter is NULL\nthe stream will be opened in 'blocking read/write' mode. In blocking mode,\nthe client can receive sample data using Pa_ReadStream and write sample data\nusing Pa_WriteStream, the number of samples that may be read or written\nwithout blocking is returned by Pa_GetStreamReadAvailable and\nPa_GetStreamWriteAvailable respectively.\n\n@param userData A client supplied pointer which is passed to the stream callback\nfunction. It could for example, contain a pointer to instance data necessary\nfor processing the audio buffers. This parameter is ignored if streamCallback\nis NULL.\n\n@return\nUpon success Pa_OpenStream() returns paNoError and places a pointer to a\nvalid PaStream in the stream argument. The stream is inactive (stopped).\nIf a call to Pa_OpenStream() fails, a non-zero error code is returned (see\nPaError for possible error codes) and the value of stream is invalid.\n\n@see PaStreamParameters, PaStreamCallback, Pa_ReadStream, Pa_WriteStream,\nPa_GetStreamReadAvailable, Pa_GetStreamWriteAvailable"]
    pub fn Pa_OpenStream(
        stream: *mut *mut PaStream,
        inputParameters: *const PaStreamParameters,
        outputParameters: *const PaStreamParameters,
        sampleRate: f64,
        framesPerBuffer: ::std::os::raw::c_ulong,
        streamFlags: PaStreamFlags,
        streamCallback: PaStreamCallback,
        userData: *mut ::std::os::raw::c_void,
    ) -> PaError;
}
unsafe extern "C" {
    #[doc = " A simplified version of Pa_OpenStream() that opens the default input\nand/or output devices.\n\n@param stream The address of a PaStream pointer which will receive\na pointer to the newly opened stream.\n\n@param numInputChannels  The number of channels of sound that will be supplied\nto the stream callback or returned by Pa_ReadStream. It can range from 1 to\nthe value of maxInputChannels in the PaDeviceInfo record for the default input\ndevice. If 0 the stream is opened as an output-only stream.\n\n@param numOutputChannels The number of channels of sound to be delivered to the\nstream callback or passed to Pa_WriteStream. It can range from 1 to the value\nof maxOutputChannels in the PaDeviceInfo record for the default output device.\nIf 0 the stream is opened as an input-only stream.\n\n@param sampleFormat The sample format of both the input and output buffers\nprovided to the callback or passed to and from Pa_ReadStream and Pa_WriteStream.\nsampleFormat may be any of the formats described by the PaSampleFormat\nenumeration.\n\n@param sampleRate Same as Pa_OpenStream parameter of the same name.\n@param framesPerBuffer Same as Pa_OpenStream parameter of the same name.\n@param streamCallback Same as Pa_OpenStream parameter of the same name.\n@param userData Same as Pa_OpenStream parameter of the same name.\n\n@return As for Pa_OpenStream\n\n@see Pa_OpenStream, PaStreamCallback"]
    pub fn Pa_OpenDefaultStream(
        stream: *mut *mut PaStream,
        numInputChannels: ::std::os::raw::c_int,
        numOutputChannels: ::std::os::raw::c_int,
        sampleFormat: PaSampleFormat,
        sampleRate: f64,
        framesPerBuffer: ::std::os::raw::c_ulong,
        streamCallback: PaStreamCallback,
        userData: *mut ::std::os::raw::c_void,
    ) -> PaError;
}
unsafe extern "C" {
    #[doc = " Closes an audio stream. If the audio stream is active it\ndiscards any pending buffers as if Pa_AbortStream() had been called."]
    pub fn Pa_CloseStream(stream: *mut PaStream) -> PaError;
}
#[doc = " Functions of type PaStreamFinishedCallback are implemented by PortAudio\nclients. They can be registered with a stream using the Pa_SetStreamFinishedCallback\nfunction. Once registered they are called when the stream becomes inactive\n(ie once a call to Pa_StopStream() will not block).\nA stream will become inactive after the stream callback returns non-zero,\nor when Pa_StopStream or Pa_AbortStream is called. For a stream providing audio\noutput, if the stream callback returns paComplete, or Pa_StopStream() is called,\nthe stream finished callback will not be called until all generated sample data\nhas been played.\n\n@param userData The userData parameter supplied to Pa_OpenStream()\n\n@see Pa_SetStreamFinishedCallback"]
pub type PaStreamFinishedCallback =
    ::std::option::Option<unsafe extern "C" fn(userData: *mut ::std::os::raw::c_void)>;
unsafe extern "C" {
    #[doc = " Register a stream finished callback function which will be called when the\nstream becomes inactive. See the description of PaStreamFinishedCallback for\nfurther details about when the callback will be called.\n\n@param stream a pointer to a PaStream that is in the stopped state - if the\nstream is not stopped, the stream's finished callback will remain unchanged\nand an error code will be returned.\n\n@param streamFinishedCallback a pointer to a function with the same signature\nas PaStreamFinishedCallback, that will be called when the stream becomes\ninactive. Passing NULL for this parameter will un-register a previously\nregistered stream finished callback function.\n\n@return on success returns paNoError, otherwise an error code indicating the cause\nof the error.\n\n@see PaStreamFinishedCallback"]
    pub fn Pa_SetStreamFinishedCallback(
        stream: *mut PaStream,
        streamFinishedCallback: PaStreamFinishedCallback,
    ) -> PaError;
}
unsafe extern "C" {
    #[doc = " Commences audio processing."]
    pub fn Pa_StartStream(stream: *mut PaStream) -> PaError;
}
unsafe extern "C" {
    #[doc = " Terminates audio processing. It waits until all pending\naudio buffers have been played before it returns."]
    pub fn Pa_StopStream(stream: *mut PaStream) -> PaError;
}
unsafe extern "C" {
    #[doc = " Terminates audio processing promptly without necessarily waiting for\npending buffers to complete."]
    pub fn Pa_AbortStream(stream: *mut PaStream) -> PaError;
}
unsafe extern "C" {
    #[doc = " Determine whether the stream is stopped.\nA stream is considered to be stopped prior to a successful call to\nPa_StartStream and after a successful call to Pa_StopStream or Pa_AbortStream.\nIf a stream callback returns a value other than paContinue the stream is NOT\nconsidered to be stopped.\n\n@return Returns one (1) when the stream is stopped, zero (0) when\nthe stream is running or, a PaErrorCode (which are always negative) if\nPortAudio is not initialized or an error is encountered.\n\n@see Pa_StopStream, Pa_AbortStream, Pa_IsStreamActive"]
    pub fn Pa_IsStreamStopped(stream: *mut PaStream) -> PaError;
}
unsafe extern "C" {
    #[doc = " Determine whether the stream is active.\nA stream is active after a successful call to Pa_StartStream(), until it\nbecomes inactive either as a result of a call to Pa_StopStream() or\nPa_AbortStream(), or as a result of a return value other than paContinue from\nthe stream callback. In the latter case, the stream is considered inactive\nafter the last buffer has finished playing.\n\n@return Returns one (1) when the stream is active (ie playing or recording\naudio), zero (0) when not playing or, a PaErrorCode (which are always negative)\nif PortAudio is not initialized or an error is encountered.\n\n@see Pa_StopStream, Pa_AbortStream, Pa_IsStreamStopped"]
    pub fn Pa_IsStreamActive(stream: *mut PaStream) -> PaError;
}
#[doc = " A structure containing unchanging information about an open stream.\n@see Pa_GetStreamInfo"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PaStreamInfo {
    #[doc = " this is struct version 1"]
    pub structVersion: ::std::os::raw::c_int,
    #[doc = " The input latency of the stream in seconds. This value provides the most\naccurate estimate of input latency available to the implementation. It may\ndiffer significantly from the suggestedLatency value passed to Pa_OpenStream().\nThe value of this field will be zero (0.) for output-only streams.\n@see PaTime"]
    pub inputLatency: PaTime,
    #[doc = " The output latency of the stream in seconds. This value provides the most\naccurate estimate of output latency available to the implementation. It may\ndiffer significantly from the suggestedLatency value passed to Pa_OpenStream().\nThe value of this field will be zero (0.) for input-only streams.\n@see PaTime"]
    pub outputLatency: PaTime,
    #[doc = " The sample rate of the stream in Hertz (samples per second). In cases\nwhere the hardware sample rate is inaccurate and PortAudio is aware of it,\nthe value of this field may be different from the sampleRate parameter\npassed to Pa_OpenStream(). If information about the actual hardware sample\nrate is not available, this field will have the same value as the sampleRate\nparameter passed to Pa_OpenStream()."]
    pub sampleRate: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaStreamInfo"][::std::mem::size_of::<PaStreamInfo>() - 32usize];
    ["Alignment of PaStreamInfo"][::std::mem::align_of::<PaStreamInfo>() - 8usize];
    ["Offset of field: PaStreamInfo::structVersion"]
        [::std::mem::offset_of!(PaStreamInfo, structVersion) - 0usize];
    ["Offset of field: PaStreamInfo::inputLatency"]
        [::std::mem::offset_of!(PaStreamInfo, inputLatency) - 8usize];
    ["Offset of field: PaStreamInfo::outputLatency"]
        [::std::mem::offset_of!(PaStreamInfo, outputLatency) - 16usize];
    ["Offset of field: PaStreamInfo::sampleRate"]
        [::std::mem::offset_of!(PaStreamInfo, sampleRate) - 24usize];
};
unsafe extern "C" {
    #[doc = " Retrieve a pointer to a PaStreamInfo structure containing information\nabout the specified stream.\n@return A pointer to an immutable PaStreamInfo structure. If the stream\nparameter is invalid, or an error is encountered, the function returns NULL.\n\n@param stream A pointer to an open stream previously created with Pa_OpenStream.\n\n@note PortAudio manages the memory referenced by the returned pointer,\nthe client must not manipulate or free the memory. The pointer is only\nguaranteed to be valid until the specified stream is closed.\n\n@see PaStreamInfo"]
    pub fn Pa_GetStreamInfo(stream: *mut PaStream) -> *const PaStreamInfo;
}
unsafe extern "C" {
